IlleniumDillon/MM32F5277/MM32/MM32_DMA2Reg.h
#ifndef _MM32_DMA2REG_H_
#define _MM32_DMA2REG_H_

#include "MM32_DMA2Regdef.h"

//DMA Interrupt Status Register
#define	DMA2_ISR		(*(MM32_DMA2_ISR*)(0x40020400+0x00))

//DMA Interrupt Flag Clear Register
#define	DMA2_IFCR		(*(MM32_DMA2_IFCR*)(0x40020400+0x04))

//DMA Channel 1 Configuration Register
#define	DMA2_CCR1		(*(MM32_DMA2_CCR1*)(0x40020400+0x08))

//DMA Channel 1 Transfer Number Register
#define	DMA2_CNDTR1		(*(MM32_DMA2_CNDTR1*)(0x40020400+0x0C))

//DMA Channel 1 Peripheral Address Register
#define	DMA2_CPAR1		(*(MM32_DMA2_CPAR1*)(0x40020400+0x10))

//DMA Channel 1 Memory Address Register
#define	DMA2_CMAR1		(*(MM32_DMA2_CMAR1*)(0x40020400+0x14))

//DMA Channel 1 Configuration Register
#define	DMA2_CCR2		(*(MM32_DMA2_CCR2*)(0x40020400+0x1c))

//DMA Channel 1 Transfer Number Register
#define	DMA2_CNDTR2		(*(MM32_DMA2_CNDTR2*)(0x40020400+0x20))

//DMA Channel 1 Peripheral Address Register
#define	DMA2_CPAR2		(*(MM32_DMA2_CPAR2*)(0x40020400+0x24))

//DMA Channel 1 Memory Address Register
#define	DMA2_CMAR2		(*(MM32_DMA2_CMAR2*)(0x40020400+0x28))

//DMA Channel 1 Configuration Register
#define	DMA2_CCR3		(*(MM32_DMA2_CCR3*)(0x40020400+0x30))

//DMA Channel 1 Transfer Number Register
#define	DMA2_CNDTR3		(*(MM32_DMA2_CNDTR3*)(0x40020400+0x34))

//DMA Channel 1 Peripheral Address Register
#define	DMA2_CPAR3		(*(MM32_DMA2_CPAR3*)(0x40020400+0x38))

//DMA Channel 1 Memory Address Register
#define	DMA2_CMAR3		(*(MM32_DMA2_CMAR3*)(0x40020400+0x3C))

//DMA Channel 1 Configuration Register
#define	DMA2_CCR4		(*(MM32_DMA2_CCR4*)(0x40020400+0x44))

//DMA Channel 1 Transfer Number Register
#define	DMA2_CNDTR4		(*(MM32_DMA2_CNDTR4*)(0x40020400+0x48))

//DMA Channel 1 Peripheral Address Register
#define	DMA2_CPAR4		(*(MM32_DMA2_CPAR4*)(0x40020400+0x4C))

//DMA Channel 1 Memory Address Register
#define	DMA2_CMAR4		(*(MM32_DMA2_CMAR4*)(0x40020400+0x50))

//DMA Channel 1 Configuration Register
#define	DMA2_CCR5		(*(MM32_DMA2_CCR5*)(0x40020400+0x58))

//DMA Channel 1 Transfer Number Register
#define	DMA2_CNDTR5		(*(MM32_DMA2_CNDTR5*)(0x40020400+0x5C))

//DMA Channel 1 Peripheral Address Register
#define	DMA2_CPAR5		(*(MM32_DMA2_CPAR5*)(0x40020400+0x60))

//DMA Channel 1 Memory Address Register
#define	DMA2_CMAR5		(*(MM32_DMA2_CMAR5*)(0x40020400+0x64))

//DMA Channel 1 Configuration Register
#define	DMA2_CCR6		(*(MM32_DMA2_CCR6*)(0x40020400+0x6c))

//DMA Channel 1 Transfer Number Register
#define	DMA2_CNDTR6		(*(MM32_DMA2_CNDTR6*)(0x40020400+0x70))

//DMA Channel 1 Peripheral Address Register
#define	DMA2_CPAR6		(*(MM32_DMA2_CPAR6*)(0x40020400+0x74))

//DMA Channel 1 Memory Address Register
#define	DMA2_CMAR6		(*(MM32_DMA2_CMAR6*)(0x40020400+0x78))

//DMA Channel 1 Configuration Register
#define	DMA2_CCR7		(*(MM32_DMA2_CCR7*)(0x40020400+0x80))

//DMA Channel 1 Transfer Number Register
#define	DMA2_CNDTR7		(*(MM32_DMA2_CNDTR7*)(0x40020400+0x84))

//DMA Channel 1 Peripheral Address Register
#define	DMA2_CPAR7		(*(MM32_DMA2_CPAR7*)(0x40020400+0x88))

//DMA Channel 1 Memory Address Register
#define	DMA2_CMAR7		(*(MM32_DMA2_CMAR7*)(0x40020400+0x8c))

//DMA Channel 1 Configuration Register
#define	DMA2_CCR8		(*(MM32_DMA2_CCR8*)(0x40020400+0x94))

//DMA Channel 1 Transfer Number Register
#define	DMA2_CNDTR8		(*(MM32_DMA2_CNDTR8*)(0x40020400+0x98))

//DMA Channel 1 Peripheral Address Register
#define	DMA2_CPAR8		(*(MM32_DMA2_CPAR8*)(0x40020400+0x9c))

//DMA Channel 1 Memory Address Register
#define	DMA2_CMAR8		(*(MM32_DMA2_CMAR8*)(0x40020400+0xA0))


#endif
